
## Plan Result (dev)

[CI link](https://github.com/iret-h-ota/tfaction-sample/actions/runs/12556595593)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.sample
* Update
  * module.sample.aws_s3_bucket.sample


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.sample will be created
  + resource "aws_s3_bucket" "sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tfaction-sample-dev-s3-2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sample.aws_s3_bucket.sample will be updated in-place
  ~ resource "aws_s3_bucket" "sample" {
        id                          = "tfaction-sample-dev-s3"
      ~ tags                        = {
            "Flag"     = "true"
          - "hogehoge" = "fugafuga" -> null
        }
      ~ tags_all                    = {
          - "hogehoge"   = "fugafuga" -> null
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"abe7437fa12512a306d58c41c6049e99815ff583","Target":"dev","Vars":{},"WorkflowName":"CI"} -->